#include <stdio.h>

// // 大端储和小端存储判断
// int main() {
//     int a = 1;
//     char* p = (char*)&a;
//     if (*p == 1) {
//         printf("little");
//     }
//     else {
//         printf("great");
//     }
//     return 0;
// }

// // 练习1
// //输出什么?
// #include <stdio.h>
// int main()
// {
//     char a = -1;            // -1
//     // 11111111111111111111111111111111 -反码
//     // 11111111                         -截断
//     // 11111111111111111111111111111111 -整型提升（有符号整型提升最高位补符号位）
//     signed char b = -1;     // -1
//     // 11111111                         -截断
//     // 11111111111111111111111111111111 -整型提升（有符号整型提升最高位补符号位）
//     unsigned char c = -1;   // 255
//     // 11111111                         -截断
//     // 00000000000000000000000011111111 -整型提升（无符号整型提升最高位补0）
//     printf("a=%d,b=%d,c=%d", a, b, c);
//     return 0;
// }

// // 练习2
// // 程序输出结果是什么？
// int main() {
//     char a = -128;
//     // 1000000000000000000000010000000
//     // 1111111111111111111111101111111
//     // 1111111111111111111111110000000 -补码
//     // 10000000
//     // 1111111111111111111111110000000
//     printf("%u\n", a);
//     return 0;
// }

// 练习3
// int main() {
//     char a = 128;
//     // 0000000000000000000000010000000 -补码
//     // 10000000
//     // 1111111111111111111111110000000
//     printf("%u\n", a);
//     return 0;
// }

// // 练习4
// int main() {
//     int i = -10;
//     // 10000000000000000000000000010100
//     // 11111111111111111111111111101011
//     // 11111111111111111111111111101100 i补码
//     unsigned int j = 10;
//     // 00000000000000000000000000001010 j补码

//     // 11111111111111111111111111110110 i+j补码
//     // 11111111111111111111111111110101
//     // 10000000000000000000000000001010 i+j原码
//     printf("%d\n", i + j);
//     return 0;
// }

// // 练习5
// int main() {
//     unsigned int i;
//     for (i = 9; i >= 0; i--) {
//         printf("%u\n", i);
//     }
//     return 0;
// }

// // 练习6
// #include <string.h>
// int main() {
//     char a[1000];
//     int i;
//     for (i = 0; i < 1000; i++) {
//         a[i] = -1 - i;
//     }
//     // -1 -2 -3 ... -127 -128 127 126 ... 2 1 0 -1
//     printf("%d", strlen(a));
//     return 0;
// }

// 练习7
int main() {
    unsigned char i = 0;
    for (i = 0; i <= 255; i++) {
        printf("hello\n");
    }
    return 0;
}

